Merge branch 'dev/add_jlink_support' of github.com:TUDelft-SPC-Lab/midge-code-neo into dev/add_jlink_support
